Repository: Bekzod9484/alclock
Catalog: lib/l10n/app_*.arb
Languages: ru, uz

source: Settings
ru: Настройки
uz: Sozlamalar

source: Alarm
ru: Будильник
uz: Signal

source: Statistics
ru: Статистика
uz: Statistika

source: Add Alarm
ru: Добавить будильник
uz: Signal qo'shish

source: Edit Alarm
ru: Редактировать будильник
uz: Signalni tahrirlash

source: Alarm Sound
ru: Звук будильника
uz: Signal ovozlari

source: Snooze
ru: Отложить
uz: Kechiktirish

# minutes
source: {count} minutes
ru: {count} минут
uz: {count} daqiqa

source: Gradual Wake
ru: Постепенное пробуждение
uz: Astagina uyg'onish

source: Vibration
ru: Вибрация
uz: Titrash

source: Volume
ru: Громкость
uz: Ovoz

source: Auto Mode
ru: Автоматический режим
uz: Avtomatik rejim

source: Automatically detect sleep
ru: Автоматически определять сон
uz: Uyquni avtomatik aniqlash

source: Manual Sleep Start
ru: Ручное начало сна
uz: Qo'lda uyqu boshlanishi

source: Set sleep time manually
ru: Установить время сна вручную
uz: Uyqu vaqtini qo'lda belgilash

source: Manual Wake Time
ru: Ручное время пробуждения
uz: Qo'lda uyg'onish vaqti

source: Set wake time manually
ru: Установить время пробуждения вручную
uz: Uyg'onish vaqtini qo'lda belgilash

source: Daily Motivational Tips
ru: Ежедневные мотивационные советы
uz: Kunlik motivatsion maslahatlar

source: Emoji Mode
ru: Режим эмодзи
uz: Emoji rejimi

source: Name
ru: Имя
uz: Ism

source: User Profile
ru: Профиль пользователя
uz: Foydalanuvchi profili

source: Alarm Settings
ru: Настройки будильника
uz: Signal sozlamalari

source: Sleep Tracking Settings
ru: Настройки отслеживания сна
uz: Uyqu kuzatish sozlamalari

source: Language
ru: Язык
uz: Til

source: Select Language
ru: Выберите язык
uz: Tilni tanlash

source: Save
ru: Сохранить
uz: Saqlash

source: Cancel
ru: Отмена
uz: Bekor qilish

source: Delete
ru: Удалить
uz: O'chirish

source: Repeat
ru: Повтор
uz: Takrorlash

source: Monday
ru: Понедельник
uz: Dushanba

source: Tuesday
ru: Вторник
uz: Seshanba

source: Wednesday
ru: Среда
uz: Chorshanba

source: Thursday
ru: Четверг
uz: Payshanba

source: Friday
ru: Пятница
uz: Juma

source: Saturday
ru: Суббота
uz: Shanba

source: Sunday
ru: Воскресенье
uz: Yakshanba

source: Wake up
ru: Пробуждение
uz: Uyg'onish

# alarmRinging
source: Alarm
ru: Будильник
uz: Signal

source: Stop
ru: Остановить
uz: Turdim

# snoozeButton
source: 5 minutes later
ru: Через 5 минут
uz: 5 daqiqadan keyin

source: Weekly Sleep
ru: Еженедельный сон
uz: Haftalik uyqu

source: Weekly sleep duration
ru: Недельная продолжительность сна
uz: Haftalik uyqu davomiyligi

# avgSleepDuration
source: Weekly average sleep duration
ru: Средняя недельная продолжительность сна
uz: Haftalik o'rtacha uyqu davomiyligi

# avgBedtime
source: Weekly average sleep time
ru: Среднее недельное время отхода ко сну
uz: Haftalik o'rtacha uyquga ketish vaqti

# avgWakeTime
source: Weekly average wake time
ru: Среднее недельное время пробуждения
uz: Haftalik o'rtacha uyg'onish vaqti

source: Best Day
ru: Лучший день
uz: Eng yaxshi kun

source: Worst Day
ru: Худший день
uz: Eng yomon kun

# tapBarToSeeDetails
source: Tap a bar to see details
ru: Нажмите на столбец, чтобы увидеть детали
uz: Tafsilotlarni ko'rish uchun ustiga bosing

source: Add Manual Entry
ru: Добавить вручную
uz: Qo'lda qo'shish

source: Manual Sleep Entry
ru: Ручной ввод сна
uz: Qo'lda uyqu kiritish

source: Date
ru: Дата
uz: Sana

source: Sleep Start
ru: Начало сна
uz: Uyqu boshlanishi

source: Wake Time
ru: Время пробуждения
uz: Uyg'onish vaqti

source: Select date
ru: Выберите дату
uz: Sanani tanlash

source: Select time
ru: Выберите время
uz: Vaqtni tanlash

source: Not set
ru: Не установлено
uz: Belgilanmagan

source: Went to sleep
ru: Ушел спать
uz: Uyquga ketdi

source: Fell asleep
ru: Ушел спать
uz: Uyquga ketdi

source: Quality
ru: Качество
uz: Sifat

source: Close
ru: Закрыть
uz: Yopish

source: Sleep record saved
ru: Запись сна сохранена
uz: Uyqu yozuvi saqlandi

source: Error
ru: Ошибка
uz: Xatolik

source: Error saving
ru: Ошибка при сохранении
uz: Saqlashda xatolik

# pleaseSelectBothTimes
source: Please select both sleep start and wake times
ru: Пожалуйста, выберите оба времени
uz: Iltimos, ikkala vaqtni ham tanlang

source: Please select wake time
ru: Пожалуйста, выберите время пробуждения
uz: Iltimos, uyg'onish vaqtini tanlang

# pleaseSelectSleepStart
source: Please select sleep start time
ru: Пожалуйста, выберите время начала сна
uz: Iltimos, uyqu boshlanish vaqtini tanlang

source: Good morning
ru: Доброе утро
uz: Xayrli tong

source: Good afternoon
ru: Добрый день
uz: Xayrli kun

source: Good evening
ru: Добрый вечер
uz: Xayrli kech

# todayIsAFreshStart
source: {name}, today's a fresh start.
ru: {name}, сегодня новый старт.
uz: {name}, bugun yangi boshlanish.

source: No alarms
ru: Нет будильников
uz: Signal yo'q

source: Add your first alarm
ru: Добавьте первый будильник
uz: Birinchi signalni qo'shing

source: Enabled
ru: Включено
uz: Yoqilgan

source: Disabled
ru: Выключено
uz: O'chirilgan

source: Once
ru: Один раз
uz: Bir marta

source: Every day
ru: Каждый день
uz: Har kuni

source: Score
ru: Оценка
uz: Ball

source: Edit estimated sleep time
ru: Изменить предполагаемое время сна
uz: Taxminiy uyqu vaqtini tahrirlash

source: Sleep Advice
ru: Совет по сну
uz: Uyqu maslahati

# sleepAdviceVeryShort1
source: Sleep duration is very short. This is harmful to your health. Try to sleep earlier today.
ru: Сон очень короткий. Это опасно для здоровья. Попробуйте лечь спать раньше сегодня.
uz: Uyqu juda qisqa. Sog'liq uchun xavfli. Bugun ertaroq uxlab dam oling.

# sleepAdviceVeryShort2
source: The body doesn't have time to recover. Aim for 7–9 hours of sleep.
ru: Организм не успевает восстановиться. Стремитесь к 7–9 часам сна.
uz: Organizm tiklanishga ulgurmaydi. 7–9 soat uyquni maqsad qiling.

# sleepAdviceShort1
source: Sleep is insufficient. Try to make at least 7 hours of sleep a habit.
ru: Сон недостаточен. Постарайтесь сделать привычкой спать хотя бы 7 часов.
uz: Uyqu yetarli emas. Kamida 7 soat uxlashni odat qiling.

# sleepAdviceShort2
source: Lack of sleep reduces concentration.
ru: Недостаток сна снижает концентрацию.
uz: Kam uyqu konsentratsiyani pasaytiradi.

# sleepAdviceModerate1
source: Good, but a bit short. Ideal sleep is 7–9 hours.
ru: Хорошо, но немного мало. Идеальный сон — 7–9 часов.
uz: Yaxshi, ammo biroz kam. Ideal uyqu 7–9 soat.

# sleepAdviceModerate2
source: Try to sleep earlier today.
ru: Попробуйте лечь спать раньше сегодня.
uz: Bugun ertaroq uxlab ko'ring.

# sleepAdviceGood1
source: Great! Healthy sleep level.
ru: Отлично! Здоровый уровень сна.
uz: Zo'r! Sog'lom uyqu darajasi.

# sleepAdviceGood2
source: Sleep norm is 7–9 hours — you're doing great!
ru: Норма сна — 7–9 часов — у вас всё отлично!
uz: Uyqu me'yori 7–9 soat — sizda hammasi a'lo!

# sleepAdviceLong1
source: Sleep is a bit too long. May put extra strain on the body.
ru: Сон немного слишком долгий. Может дать лишнюю нагрузку на организм.
uz: Uyqu biroz uzunroq. Organizmga ortiqcha yuk tushishi mumkin.

# sleepAdviceLong2
source: More activity is recommended.
ru: Рекомендуется больше активности.
uz: Ko'proq faol bo'lish tavsiya etiladi.

# sleepAdviceVeryLong1
source: Too much sleep. This may be a sign of fatigue or stress.
ru: Слишком много сна. Это может быть признаком усталости или стресса.
uz: Juda ko'p uyqiga ketgan. Bu charchoq yoki stress belgisidir.

# sleepAdviceVeryLong2
source: Try to keep sleep around 7–9 hours.
ru: Постарайтесь держать сон около 7–9 часов.
uz: Uyquni 7–9 soat atrofida ushlashga harakat qiling.

source: Weekly Sleep Analysis
ru: Еженедельный анализ сна
uz: Haftalik uyqu tahlili

# motivationNote
source: Note (optional)
ru: Напоминание (необязательно)
uz: Eslatma (majburiy emas)

# motivationNoteHint
source: Enter a note...
ru: Введите напоминание...
uz: Eslatma kiriting...
